Practica/Volumenes Finitos/OpenFoam/Ejercicio3_Velocidad/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	carasuperior
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    lateralizquierda
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lateralderecha
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	carainferior
	{
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
